// Пакетний менеджер npm

// •	Сайт npmjs.com - використовується для пошуку та ознайомлення з документацією пакетів.
// •	Інтерфейс командного рядка (CLI) - запускається з терміналу і надає набір команд для роботи з реєстром і пакетами.
//  Дозволяє створювати скрипти для запуску в терміналі.
// •	Реєстр пакетів (registry) - велика загальнодоступна база даних інструментів розробки (пакетів).

// Команди NPM

// •	npm init - ініціалізує npm в проекті і створює файл package.json
// •	npm install - встановлює всі залежності, перелічені в package.json
// •	npm list --depth=0 - виведе в терміналі список локально встановлених пакетів з номерами їх версій, без залежностей
// •	npm install [package-name] - встановить пакет локально у папку node_modules
// •	npm uninstall [package-name] - видалить пакет, встановлений локально і оновить package.json
// •	npm start і npm test - запустить скрипт start або test, розташований в package.json
// •	npm run [custom-script] - запустить кастомний скрипт, розташований в package.json
// •	npm outdated - використовується для пошуку оновлень, виявить сумісні версії програмно і виведе список доступних оновлень
// •	npm update - оновить всі пакети до максимально дозволеної версії

// Ініціалізація проекту

// npm init –yes

// package.json

// {
//     "name": "tut",
//     "version": "1.0.0",
//     "main": "index.js",
//     "scripts": {
//       "test": "echo \"Error: no test specified\" && exit 1"
//     },
//     "keywords": [],
//     "author": "Alex <mitrofanov.322@gmail.com>",
//     "license": "ISC",
//     "description": ""
//   }

// npm-скрипти

// {
//     "scripts": {
//       "start": "node index.js"
//     }
//   }

// Встановлення пакетів

// npm install validator

// Видалення пакетів

// npm uninstall validator

// Встановлення певної версії пакета

// npm install validator@1.0.0

// Типи залежностей

// •	-save - вказує, що додається залежність, яка увійде до фінального продукту.
//  Пакет буде встановлений локально, в папку node_modules і буде доданий запис в поле dependencies в package.json.
// •	-save-dev - вказує, що додається залежність розробки. Пакет буде встановлений локально в папку node_modules,
//  і буде доданий запис в поле devDependencies в package.json.
// •	-global - вказує, що додається глобальна залежність, тобто інструмент, який доступний для будь-якого проекту.
//  Пакет буде встановлений глобально (в систему).

// Управління версіями пакетів

// •	npm outdated - використовується для пошуку оновлень, виявить сумісні версії програмно.
// •	npm update - оновить всі пакети до максимально дозволеної версії.
// •	npm update [ім'я-пакета] - оновить зазначений пакет.

// Управління кешем

// npm cache clean
