// Знайомство з Webpack

// Webpack - це збирач JS-модулів, менеджер модульних залежностей,
// який аналізує дерево залежностей і створює один або декілька результуючих файлів,
// що містять всю кодову базу проекту. Вибудовує порядок підключення модулів, збирає, мініфікує, запаковує та багато іншого.

// Принцип роботи

// index.html
// <script src="sum.js"></script>
// <script src="multiply.js"></script>
// <script src="index.js"></script>

// Webpack перетворює залежності в модулі і зшиє в один або декілька файлів.
//  Кожен модуль буде мати закритий простір імен і підключатися у потрібний час і правильному порядку.

// Налаштування
