// "use strict";

/* 

№ основи синтаксису

[ [a] = [ [b] * [2] ] ]
Інструкція з прикладу вище містить 5 виразів, які виділені квадратними дужками для візуалізації (це не синтаксис мови):
•	[2] - вираз значення літерала.
•	[b]і[a] - вирази змінної, означають необхідність підставити значення змінної, але лише у тому випадку,
 якщо змінна складається із правої частини виразу присвоювання.
•	[b * 2] - арифметичний вираз множення.
•	[a = b * 2] - вираз присвоювання. У нашому випадку вказує на необхідність обчислення правої частини виразу 
і присвоювання результату змінної a у лівій частині виразу.


# суворий режим

Нова можливість у специфікації ECMAScript 5, яка дозволяє переводити скрипт
у режим повної відповідності сучасному стандарту. Це запобігає певним помилкам,
 як-от використання небезпечних і застарілих конструкцій.
Для того, щоб перевести скрипт в суворий режим, достатньо зазначити директиву на початку js-файлу.
 Завжди пишіть код в суворому режимі.
script.js
"use strict";
 Це коментар. Далі йде увесь код JS-файлу

*/