// Поширення подій

// Поширення подій (event propagation) - це термін, що описує життєвий цикл події,
//  який має три етапи: занурення, таргетинг і спливання.
//  На практиці найчастіше використовують тільки фазу спливання.

// •	Capturing phase (занурення) - подія починається на window і тоне (проходить через усі елементи-предки)
// до найглибшого цільового елемента, на якому відбулася дія, наприклад, клік.
// •	Target phase (таргетинг) - подія дійшла до цільового елемента. Цей етап містить тільки повідомлення елемента про те,
//  що на ньому відбулася дія.
// •	Bubbling phase (спливання) - кінцева фаза, подія спливає від найглибшого, цільового елемента,
//  через усі елементи-предки до window.
